app/Http/Controllers/AreaTypeController.php

    public function getDropDownOptions(Request $request)
    {
        $rows = AreaType::all();
---
SELECT * FROM `hed_area_types` WHERE `hed_area_types`.`deleted_at` IS NULL