app/Http/Controllers/DistrictController.php

    public function getDropDownOptions(Request $request)
    {
        $rows = District::all();
---
SELECT * FROM `hed_districts` WHERE `hed_districts`.`deleted_at` IS NULL