app/Http/Controllers/GenderController.php

    public function getDropDownOptions(Request $request)
    {
        $rows = Gender::all();
---
SELECT * FROM `hed_genders` WHERE `hed_genders`.`deleted_at` IS NULL