app/Http/Controllers/HomeController.php

SELECT * FROM `hed_application_types` WHERE `hed_application_types`.`deleted_at` IS NULL ORDER BY `name` ASC
---
    public function homePage() {
        $applicationTypes = ApplicationType::orderBy('name', 'ASC')->get();