app/Http/Controllers/LocationController.php

    public function getDropDownOptions(Request $request)
    {
        $rows = Location::all();
---
SELECT * FROM `hed_locations` WHERE `hed_locations`.`deleted_at` IS NULL