app/Http/Controllers/NatureOfOwnershipController.php

    public function getDropDownOptions(Request $request)
    {
        $rows = NatureOfOwnership::all();
---
SELECT * FROM `hed_nature_of_ownerships` WHERE `hed_nature_of_ownerships`.`deleted_at` IS NULL