app/Http/Controllers/ShiftController.php

SELECT * FROM `hed_shifts` WHERE `hed_shifts`.`deleted_at` IS NULL
---
    public function getDropDownOptions(Request $request) {
        $selected = $request->id;
        $rows = Shift::all();