app/Http/Controllers/TehsilController.php

    public function getDropDownOptions(Request $request) {
        $options = '<option value="">Select Tehsil</option>';
        if ($request->district_id) {

            $selected = $request->id;
            $rows = Tehsil::where(['district_id' => $request->district_id])->get();
---
SELECT * FROM `hed_tehsils` WHERE (`district_id` = '1') and `hed_tehsils`.`deleted_at` IS NULL